RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_cmu.h
/* Bit fields for CMU USBCTRL */
#define _CMU_USBCTRL_RESETVALUE                           0x00000000UL                          /**< Default value for CMU_USBCTRL */
#define _CMU_USBCTRL_MASK                                 0x00000087UL                          /**< Mask for CMU_USBCTRL */
#define _CMU_USBCTRL_USBCLKSEL_SHIFT                      0                                     /**< Shift value for CMU_USBCLKSEL */
#define _CMU_USBCTRL_USBCLKSEL_MASK                       0x7UL                                 /**< Bit mask for CMU_USBCLKSEL */
#define _CMU_USBCTRL_USBCLKSEL_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for CMU_USBCTRL */
#define _CMU_USBCTRL_USBCLKSEL_USHFRCO                    0x00000000UL                          /**< Mode USHFRCO for CMU_USBCTRL */
#define _CMU_USBCTRL_USBCLKSEL_HFXO                       0x00000001UL                          /**< Mode HFXO for CMU_USBCTRL */
#define _CMU_USBCTRL_USBCLKSEL_HFXOX2                     0x00000002UL                          /**< Mode HFXOX2 for CMU_USBCTRL */
#define _CMU_USBCTRL_USBCLKSEL_HFRCO                      0x00000003UL                          /**< Mode HFRCO for CMU_USBCTRL */
#define _CMU_USBCTRL_USBCLKSEL_LFXO                       0x00000004UL                          /**< Mode LFXO for CMU_USBCTRL */
#define _CMU_USBCTRL_USBCLKSEL_LFRCO                      0x00000005UL                          /**< Mode LFRCO for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKSEL_DEFAULT                     (_CMU_USBCTRL_USBCLKSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKSEL_USHFRCO                     (_CMU_USBCTRL_USBCLKSEL_USHFRCO << 0) /**< Shifted mode USHFRCO for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKSEL_HFXO                        (_CMU_USBCTRL_USBCLKSEL_HFXO << 0)    /**< Shifted mode HFXO for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKSEL_HFXOX2                      (_CMU_USBCTRL_USBCLKSEL_HFXOX2 << 0)  /**< Shifted mode HFXOX2 for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKSEL_HFRCO                       (_CMU_USBCTRL_USBCLKSEL_HFRCO << 0)   /**< Shifted mode HFRCO for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKSEL_LFXO                        (_CMU_USBCTRL_USBCLKSEL_LFXO << 0)    /**< Shifted mode LFXO for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKSEL_LFRCO                       (_CMU_USBCTRL_USBCLKSEL_LFRCO << 0)   /**< Shifted mode LFRCO for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKEN                              (0x1UL << 7)                          /**< USB Rate Clock Enable */
#define _CMU_USBCTRL_USBCLKEN_SHIFT                       7                                     /**< Shift value for CMU_USBCLKEN */
#define _CMU_USBCTRL_USBCLKEN_MASK                        0x80UL                                /**< Bit mask for CMU_USBCLKEN */
#define _CMU_USBCTRL_USBCLKEN_DEFAULT                     0x00000000UL                          /**< Mode DEFAULT for CMU_USBCTRL */
#define CMU_USBCTRL_USBCLKEN_DEFAULT                      (_CMU_USBCTRL_USBCLKEN_DEFAULT << 7)  /**< Shifted mode DEFAULT for CMU_USBCTRL */

/* Bit fields for CMU USBCRCTRL */
#define _CMU_USBCRCTRL_RESETVALUE                         0x00000000UL                            /**< Default value for CMU_USBCRCTRL */
#define _CMU_USBCRCTRL_MASK                               0x00000003UL                            /**< Mask for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_USBCREN                             (0x1UL << 0)                            /**< Clock Recovery Enable */
#define _CMU_USBCRCTRL_USBCREN_SHIFT                      0                                       /**< Shift value for CMU_USBCREN */
#define _CMU_USBCRCTRL_USBCREN_MASK                       0x1UL                                   /**< Bit mask for CMU_USBCREN */
#define _CMU_USBCRCTRL_USBCREN_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_USBCREN_DEFAULT                     (_CMU_USBCRCTRL_USBCREN_DEFAULT << 0)   /**< Shifted mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_USBLSCRMD                           (0x1UL << 1)                            /**< Low Speed Clock Recovery Mode */
#define _CMU_USBCRCTRL_USBLSCRMD_SHIFT                    1                                       /**< Shift value for CMU_USBLSCRMD */
#define _CMU_USBCRCTRL_USBLSCRMD_MASK                     0x2UL                                   /**< Bit mask for CMU_USBLSCRMD */
#define _CMU_USBCRCTRL_USBLSCRMD_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for CMU_USBCRCTRL */
#define CMU_USBCRCTRL_USBLSCRMD_DEFAULT                   (_CMU_USBCRCTRL_USBLSCRMD_DEFAULT << 1) /**< Shifted mode DEFAULT for CMU_USBCRCTRL */

/** @} */
/** @} End of group EFM32GG11B_CMU */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

